Tekla Open API Reference for Tekla Structures 2025
SpaceElement Class
 The SpaceElement class defines a space between the desired elements.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.ElementBase
 Tekla.Structures.Drawing.SpaceElement
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SpaceElement : ElementBase
<SerializableAttribute>
Public NotInheritable Class SpaceElement
	Inherits ElementBase
The SpaceElement type exposes the following members.
Constructors
Name | Description
SpaceElement
Initializes a new instance of the SpaceElement class
Top
Methods
Name | Description
Clone
 Clones the object.
 (Overrides ElementBase.Clone().)
GetUnformattedString
 Returns the content as a string without formatting.
 (Overrides ElementBase.GetUnformattedString().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ElementBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace